var qlist = [{
  q:"ماھی الخطة التی اتبعھا المسلمون لفتح الاندلس التی تعد امرا طبيعييا؟ وماکانت الاھداف وراء ھذا الفتح؟",
  a:`اندلس کو فتح کرنے کے لیے مسلمانوں کے لیے یہ ضروری تھا کہ وہ اپنی سرحدوں کو پرامن کریں اور اسلامی دعوت کی نشرواشاعت کریں اور اس کا طریقہ یہی تھا کہ وہ اپنی سرحدوں سے آگے بڑھ کر جہاد کریں تاکہ اسلامی عقیدہ اپنی پوری طاقت و قوت کے ساتھ پھیل سکے۔ چنانچہ مسلمانوں نے آخر کار شمالی افریقہ کو فتح کرکے اسلامی حکومت قائم کی جس کا مقصد اندلس کو فتح کرنا تھا‌۔`
},
{
  q:`تکلم عن ماھية فکرۃ فتح الجزيرۃ"الايبيريۃ" وعن قدامة ھذہ الفکرۃمع القاءالضوءعلي المحاولة الأولی لفتحھا`,
  a:`جزیرہ ایبیریہ کی فتح ایک مکمل اسلامی سوچ تھی، اور کہا جاتا ہے کہ اس سوچ کا آغاز حضرت عثمان رضی اللہ عنہ کے زمانے میں ہی ہو گیا تھا جب عقبہ بن نافع فہری نے یہ منصوبہ بنایا کہ اگر  طاقت ہوگی تو وہ اسپین تک اپنی حکومت کو بڑھائیں گے۔اس کی پہلی شروعات کرتے ہوئے 89ھ میں موسیٰ بن نصیر نے اپنے بیٹے عبداللہ کو بھیجا جس نے اسپین کے دو جزیروں میورقہ اور منورقہ کو فتح کرلیا۔`
},
{
  q:`لماذا تردد الخليفة الأموی الوليدبن عبد الملک لقيام لفتح الأندلس؟ومن أقنعه بھذا الامر وکيف؟تحدث بالايجاز`,
  a:`أموی خلیفہ ولید بن عبدالملک مسلمانوں پرخوف کھا رہے تھے کہ وہ کامیاب نہیں ہو پائیں گے اور ہلاکت میں واقع ہو جائیں گے، اس وجہ سے وہ اندلس کو فتح کرنے میں تردد کر رہے تھے۔ آخر ولید کو موسی بن نصیر نے منوا لیا اور یہ اتفاق ہوا کہ فتح سے پہلے وہاں چھان بین کرنے کے لئے سریوں کو بھیجا جائے۔`
},
{
  q:`ماتعرف عن سريةاستکشافية؟من أرسلھا الی جنوب أسبانيا؟کم کان عددھا؟وبماذارجعت ھذہ السرية؟`,
  a:`موسی بن نصیر نے رمضان المبارک 91ھ میں ایک لشکر بھیجا جس کو سریہ استكشافیہ کے نام سے موسوم کیا جاتا ہے۔ اس کا مقصد فتح اندلس کے لیے وہاں کے حالات سے مسلمانوں کو آگاہ کرنا تھا۔ لشکر میں پانچ سو افراد اور ایک سو گھوڑے تھے۔ یہ لوگ فتح کے لیے کارروائی سے متعلق اطمینان بخش خبریں لے کر واپس ہوئے۔`
},
{
  q:`تحدث عن المكاتبات التى تطايرت بين الوليدبن عبدالملك وموسى بن نصير؟ وعلام تم الاتفاق بينھما؟`,
  a:`موسی بن نصیر نے امیر المومنین ولید بن عبد الملک کو خط لکھا جس میں انہوں نے حملہ کرنے کی اجازت مانگی تھی تو ولید بن عبد الملک نے اس کو جواب میں لکھا کہ وہاں حملہ کرنے سے پہلے حالات کا جائزہ لے لو، اور یاد رکھنا اس خوفناک سمندر کے بیچ مسلمانوں سے دھوکہ مت کرنا۔ تو موسی نے جواب دیا کہ یہ کوئی موج مارنے والا سمندر نہیں، بلکہ ایک خلیج ہے جس کی ساری چیزیں ظاہر ہیں۔ آخرکار ولید سے اتفاق کرتے ہوئے موسی بن نصیر نے چار سو لوگوں کو بھیج دیا، جو اندلس کے سامنے ایک جزیرہ میں قیام پذیر ہوئے۔`
},
{
  q:`جھزموسی بن نصیر جیشا لفتح الأندلس،کم کان عددھا؟ومن عین‌قائدا لھا؟ومن جاءھانجدۃ لھا؟تکلم عنھا مع ايجاز القول عن حیاۃطارق بن زياد`,
  a:`فتح اندلس کے لیے موسی بن نصیر نے ایک لشکر تیار کیا جس کی تعداد سات ہزار تھی اور انہوں نے اس کا قائد طارق بن زیاد کو مقرر کیا پھر طریف بن مالک ان کے پاس تقریبا پانچ ہزار لشکر کے ساتھ  کُمَک لے کر آئے۔
طارق بن زیاد کا شمار عسکری رہنماؤں میں سے ہوتا ہے، جو کہ شروع میں عمومی صوبے کے گورنر اور موسی بن نصیر کے نائب تھے۔ آپ ایک معروف و ممتاز قائد تھے جنہوں نے بہت سے ممالک کو فتح کیا۔‌ آپ نہایت متقی اور بلند ہمت تھے، نیز آپ کے حسن اخلاق کی وجہ سے لوگ بے حد احترام کی نظر سے دیکھتے تھے۔`
},
{
  q:`متى عبرطارق بن زياد وجیشه من سبتة إلى الطرف الأسبانی؟والسفن التى كانت معھا ھل ھى كانت للمسلمین او لِیلیان؟فصل الكلام فیھا بالأدلة والبراھین.`,
  a:`طارق بن زیاد اور ان کے لشکر نے 5 رجب 92ھ کو سبتہ سے اسبانی کی طرف عبور کیا
 جو کشتیاں ان کے ساتھ تھیں، وہ راجح قول کے مطابق مسلمانوں کی تھیں، نا کہ لیلیان کی۔ بہت سے لوگ اس میں شک کرتے ہیں لیکن اس کی کوئی حقیقت نہیں۔ اس کے بعض شواہد مندرجہ ذيل ہيں:

1۔ کشتیوں کے بنانے میں مسلمانوں کی کارکردگی
واضح تھی، کیوں کہ وہی کشتیوں کی ضرورت کو جانتے تھے ۔ نیز ان لوگوں نے کشتی بنانے کے لئے متعدد کارخانے بھی قائم کیے تھے، جیسے تونس کا کارخانہ جس کو حسان بن نعمان الغسانی نے قائم کیا تھا۔ 

2۔ مسلمانوں کا شمالی افریقہ سے بحری بیڑوں میں سبقت کرنا۔ جیسا کہ معاویہ بن خدیج نے 46ھ‌ میں ہی اسلامی بحری بیڑوں کی طرف توجہ دی تھی۔

3۔ طریف بن مالک پانچ ہزار کے لشکر کو مضیق سے لیکر اندلس پہنچے تھے جس میں انہوں نے 4 کشتیاں استعمال کی تھیں۔ ان ہی کشتیوں کو طارق بن زیاد نے اپنے سات ہزار کے لشکر کو مضیق سے عبور کرانے میں استعمال کیا۔ البتہ یہاں کہیں بھی لیلیان کا ذکر نہیں۔`
},
{
  q:`على أی جبل تجمع الجیش الاسلامى؟وماھي الأسماء الأخر لھذا الجبل؟وماکان اسمه القديم؟تكلم بالايجاز.`,
  a:`اسلامی لشکر جبل صخری پر جمع ہوا۔ اس پہاڑ کے متعدد نام ہیں، جیسے: جبل الصخرة ، جبل الفتح، مضیق ، اور جبل الطارق۔ اس کا پرانا نام جبل کالبی ہے۔`
},
{
  q:`أذكرالحديث الذى استشھد به ابن حزم على فضل فاتحي الأندلس مع تفصیل الکلام علی وجه الاستدلال به۔`,
  a:`ابن حزم رحمہ اللہ نے فاتحین اندلس کی فضیلت پر درج ذیل حدیث سے استدلال کیا ہے:
حضرت انس سے روایت ہے کہ رسول اللہﷺ ام حرام بنت ملحان کے پاس جو عبادہ بن صامت کے نکاح میں تھیں تشریف لے جایا کرتے تھے، ایک دن ان کے پاس تشریف لے گئے تو انہوں نے آپ کو کھانا کھلایا اور آپ کے سر کو سہلانے لگیں تو رسول اللہ ﷺ کو نیند آگئی، پھر آپ بیدار ہوئے تو ہنس رہے تھے؟ آپ نے فرمایا کہ میری امت کے کچھ لوگ میرے سامنے پیش کیے گئے جو اللہ کی راہ میں جہاد کر رہے تھے، سمندر کے بیچوں کے بیچ جہاز پر سوار بادشاہوں کی طرح تختوں پر بیٹھے ہوئے تھے، ام حرام نے کہا کہ میں نے عرض کیا یا رسول اللہ (صلی اللہ علیہ وآلہ وسلم) آپ اللہ سے دعا کریں کہ مجھ کو ان میں شامل کر دے، نبی ﷺ نے ان کے لیے دعا کی، پھر آپ نے اپنا سر مبارک رکھا اور سو گئے، پھر بیدار ہوئے تو ہنس رہے تھے میں نے پوچھا کہ یا رسول اللہ ﷺ آپ کس بات پر ہنس رہے ہیں، آپ نے فرمایا میری امت میں سے کچھ لوگ میرے سامنے پیش کیے گئے جو اللہ کی راہ میں جہاد کر رہے تھے، جیسے پہلی بار فرمایا تھا، ام حرام نے کہا یا رسول اللہ ﷺ دعا کریں کہ اللہ مجھ کو ان میں شامل کر دے آپ نے فرمایا تو پہلے لوگوں میں سے ہے، چنانچہ ام حرام معاویہ بن ابی سفیان کے زمانہ میں جہاز پر سوار ہوئیں تو سمندر سے نکلتے وقت اپنی سواری سے گر پڑیں اور وفات پاگئیں۔

وجہ استدلال یہ ہے کہ رسول اللہ نے دو سمندری جہادوں کا ذکر کیا، جن میں سے ایک کا ذکر تو حدیث میں موجود ہے ، البتہ دوسرے سمندری جہاد‌ سے مراد یہی فتح اندلس ہے۔`
},
{
  q:`الى متى استمرت المعركةالتي وقعت قرب جبل طارق؟تحدث عنھا بدقة، ومن انتصرفیھا؟`,
  a:`یہ جنگ مقام اسبانیا کے اندر جبل طارق کے پاس طارق بن زیاد کی قیادت میں‌ 92ھ میں لڑی گئی تھی جس میں اسلامی لشکر کی تعداد
سات ہزار تھی۔ یہ جنگ مسلسل تین دن تک قائم رہی،‌ جس میں اسلامی لشکر کو فتح حاصل ہوئی ۔`
},
{
  q:`تكلم عن الجيشين:جيش طارق بن زياد وجيش لذريق،عن عددھما، وتجھيزھما،والقوۃالموجودۃفيھمامع اإلشارۃالى الفارق بينھما.`,
  a:`طارق بن زیاد کا لشکر:
تعداد: طارق خود سات ہزار کا لشکر لے کر گیا تھا، پھر اس نے موسی بن نصیر سے مدد مانگی، جس نے مزید پانچ ہزار فوج بھیج دی، جس سے کل تعداد بارہ ہزار ہو گئی۔
قوت و استعداد: مسلمانوں کی فوجی طاقت کفار کے مقابلے کہیں زیادہ کم تھی، البتہ ان کے وہ ایمانی جوش و جذبہ موجود تھا، جس کی بنا پر آسمانی مدد ان کے لئے تیار تھی۔

لذریق کا لشکر:
تعداد: اس سلسلے میں مورخین کے درمیان اختلاف ہے، چنانچہ بعض نے ان کی تعداد ایک لاکھ بتائی ہے، اور سب سے کم تعداد چالیس ہزار بیان کی گئی ہے۔
قوت و استعداد: لشکر کے ہر سپاہی کے ساتھ ایک گھوڑا تھا، جس کے پیچھے گھوڑا گاڑی میں مال و زر لدا ہوا تھا، اسی طرح یہ لوگ بے شمار جانوروں پر رسیاں لائے تھے، تاکہ مسلمانوں کو قیدی بنا سکیں۔ اور کسی مدد کے لئے ان کا شہر بھی قریب تھا۔

دونوں میں فرق:
دونوں لشکروں کا بنیادی فرق یہ تھا کہ مسلمانوں کے اندر عظمت اسلام کا وہ جوش و جنون موجود تھا، جس جذبہ سے کفار عاری تھے۔`
},
{
  q:`ألق الضوء على معركة بلاط الشھداء بايجاز تام`,
  a:`معرکہ بلاط‌ الشہداء: یہ جنگ رمضان 114ھ میں فرانس کے اندر عبد الرحمان النافعی کی قیادت میں لڑی گئی تھی۔ یہ جنگ دس دن تک قائم رہی جس میں مسلمانوں کو کافی جانی ومالی نقصان پہونچنے کے بعد اخیر میں فتح حاصل ہوئی ۔`
},
{
  q:`لخص القول فی ذكر الخطبة التى القاھا طارق بن زياد، ثم وضح مدى صحة نسبتھا اليه بالأدلة`,
  a:`جب طارق بن زیاد لذریق کےلشکر کے پاس پہنچے تو وہ اپنے ساتھیوں کے درمیان کھڑے ہوئے اور‌ ایک خطبہ دیا، جس کا خلاصہ درج ذیل ہے:
 آپ نے پہلے اللہ تعالی کی حمد وثنا بیان کی۔ پھر مسلمانوں کو جہاد پر ابھارا اور شہادت کی ترغیب دی۔ اس لیے کہ اس وقت آگے دشمن کا لشکر اور پیچھے سمندر تھا اور پاس میں صرف ضرورت بھر سامان تھا ۔ اس لئے طارق بن زیاد نے مجاہدین کو ترغیب دی کہ صبر رکھو اور جہاد کرو۔

نسبت ؟؟؟؟؟؟`
},
{
  q:`ھل احرق طارق بن زيادالسفن؟وماحقيقة ھذہ القصة؟ تكلم بالادلة۔`,
  a:`کتب تاریخ کے اندر یہ مشہور ہے کہ طارق بن زیاد نے ساری کشتیاں جلا دی تھیں، اس قصہ کی کوئی حقیقت نہیں، بلکہ یہ ایک گھڑا ہوا قصہ ہے۔ اس قصہ کے من گھڑت ہونے کے چند دلائل یہ ہیں۔ 
1۔ اگر وہ کشتیاں اہل یلیان کی تھیں، تو طارق بن زیاد کا ان پر کوئی حق نہیں تھا کہ اس میں جیسے چاہتے تصرف کرتے۔
2۔ اور اگر وہ مسلمانوں کی تھیں، پھر بھی یہ عمل مسلمانوں کے لیے بے فائدہ بلکہ نقصان دہ تھا، کیوں کہ کسی بھی وقت انہیں مدد کی ضرورت پڑ سکتی تھی‌۔`
},
{
  q:`متى تلاقي الجيشان جيش طارق بن زياد وجيش لذريق؟ والى متى استمر القتال بينھما؟ ومن انتصرفيھا؟ اوجزالقول فى ذكرھامع بيان وصف الحرب`,
  a:`امام رازی کے بقول طارق اور لذریق کے لشکر کا آمنا سامنا اٹھائیسویں رمضان کو ہوا، جن کے درمیان آٹھ دن تک لگاتار جنگ ہوتی رہی۔ آخرکار مسلمانوں کو فتح نصیب ہوئی اور مشرکین کو شکست ملی۔
یہ جنگ آٹھوں دن نہایت شدت سے جاری رہی، جس میں دونوں فریقین نے صبر و ہمت کا مظاہرہ کیا۔ کفار کی کثرت تعداد کے سبب بہت سارے مسلمانوں نے جام شہادت نوش کیا، یہاں تک کہ اللہ کی مدد آ پہنچی اور کفار کو شکست ہوئی ۔`
},
{
  q:`عدد المدن التى فتحھا طارق بن زياد فى غزوۃ الاندلس مع القاء الضوء بالايجاز على المعركة التى دارت بين المسلمين واھل استجة`,
  a:`طارق بن زیاد نے غزوۂ اندلس میں مندرجہ ذیل شہروں کو  یکے بعد دیگرے فتح کیا تھا۔ 
1۔ شہر شذونہ محاصرہ کے بعد
2۔ شہر مورور
3۔ شہر قرمونہ 
4۔ شہر إشبیلیہ بطور صلح 
5۔ اس کے بعد شہر استجّہ کی طرف روانہ ہوۓ ۔ جہاں مسلمانوں اور اہل استجّہ کے درمیان جنگ ہوئی۔ مسلمان کثرت سے جاں بحق ہوئے اس کے بعد اللہ رب العالمین نے مسلمانوں کو فتح عطا کی اور اہل استجہ کو شکست سے دوچار ہونا پڑا ۔`
},
{
  q:"تكلم بالإيجاز عن السرايا التي أرسلها طارق بن زياد إلى عدة جهات",
  a:`استجہ میں طارق بن زیاد نے متعدد جہات میں سریوں کو بھیجا۔ مثلاً:
1۔ شہر قرطبہ کی طرف سات سو گھڑ سواروں کو مغیث رومی کی قیادت میں بھیجا، جنہوں نے قرطبہ فتح کر لیا۔
2۔ شہر مالقہ، إلبیرۃ، غرناطہ، تدمیر وغیرہ کی طرف سریوں کو بھیجا، جنہوں نے چند لڑائیوں کے بعد ان سب کو فتح کر لیا۔`
},
{
  q:`من ھوموسى بن نصير؟وماكانت صفاته؟ومادورہ فى فتح الاندلس؟`,
  a:`ابو عبد الرحمان موسی بن نصیر مشہور قائد ہیں، جن کی پیدائش 19ھ میں ہوئی اور وفات 97ھ میں ہوئی۔ آپ تابعین میں سے ہیں اور تمیم داری سے روایت کی ہے۔
موسی کی صفات : وہ ایک بہادر اور بزرگ سپاہی تھے اور اللہ سے ڈرنے والے اور متقی تھے۔ ماہر علم و رائے والے تھے اور باہمت شریف و پیش قدمی کرنے والے شخص تھے۔ 
 فتح اندلس میں موسی کا کردار: موسی بن نصیر اپنی قیادت کے ساتھ فتح اندلس میں برابر شریک رہے۔ طارق بن زیاد کو اندلس کی طرف متوجہ کرنے کے بعد وہ خبروں اور حادثوں کی چھان بین کرتے تھے۔ اور اس عظیم الشان فتح کے لئے جن چیزوں کی ضرورت تھی، ان کی تیاری میں لگے تھے۔`
},
{
  q:`متى خرج موسى بن نصير الى غزوۃ الاندلس؟ومن اين خرج؟ومن استخلفه بعدہ؟وكم كان عدد الجيش الذى كان معه؟ تكلم بالايجاز`,
  a:`موسی بن نصیر اندلس کے لئے رجب 93ھ میں افریقہ سے نکلے۔ انہوں نے اپنے بعد اپنے بیٹے عبدالرحمان بن موسی بن نصیر کو جانشین بنایا۔ ان کے ساتھ اٹھارہ ہزار کی فوج تھی۔`
},
{
  q:`بأي طريق وصل موسى بن نصير الاندلس؟ومتى وصل؟ واين نزل؟ وكم كان عدد الرايات مع الجيش؟ تكلم مؤجزا`,
  a:`موسی بن نصیر جبل طارق کے پاس سے ہوکر اندلس پہنچے۔ اس پہاڑ کے قریب ایک اور پہاڑ ہے جو موسی بن نصیر کی طرف منسوب ہے۔ وہ اندلس ماہ رمضان 93ھ میں پہنچے ۔ وہ جبل طارق کے پاس اترے۔ اور ان کے پاس بیس سے کچھ زائد جھنڈے تھے۔`
},
{
  q:`تحدث عن كيفية فتح قرمونة واشبيلية بايجاز غيرمخل`,
  a:`شہر قرمونہ اندلس کا سب سے محفوظ شہر تھا، اور محاصرہ یا قتال کے ذریعے اس کو فتح کرنا سب سے زیادہ دشوار تھا‌۔ چنانچہ یہاں حیلہ سے کام لیتے ہوئے موسی اپنے سواروں کے ساتھ رات کے وقت داخل ہوا، دروازے کھول دئے اور پہریداروں کو پکڑ لیا، اس طرح شہر فتح ہوگیا۔
قرمونہ کے پاس میں اشبیلیہ تھا، جو نہایت شان و شوکت، شاندار عمارات اور آثار قدیمہ سے بھرپور تھا۔ موسی نے کئی مہینوں تک اس کا‌‌ محاصرہ کرکے رکھا، اور آخرکار اسے فتح کر لیا ۔`
},
{
  q:`تكلم عن فتح مدينة باجة مع الاشارۃ الى اختلاف المؤرخين فيمن فتحھا بالایجاز`,
  a:` جب موسی بن نصیر شہر ماردہ کو فتح کرنے چلا، اسی وقت راستے میں شہر لبلہ اور باجہ کو بھی فتح کیا، کیوں کہ یہ شہر ماردہ کے راستے پر پڑتے ہیں۔ شہر باجہ کو اس لئے بھی فتح کیا کیونکہ بعض لوگ اشبیلیہ سے باجہ کی طرف بھاگ گئے تھے۔ بعض مورخین نے کہا ہے کہ لبلہ اور باجہ شہر کو ان کے بیٹے عبدالعزیز نے فتح کیا تھا جسے موسی نے بھیجا تھا۔`
},
{
  q:`ماذا تعرف عن مدينة ماردۃ؟ من بناھا؟ وكيف تم فتحھا؟ اكتبھابالايجاز`,
  a:``
},
{
  q:`من ھوعبدالعزيز بن موسى بن نصيروكيف تم فتح تدمير بقيادته وعلام تم الصلح؟`,
  a:``
},
{
  q:``,
  a:``
},
{
  q:``,
  a:``
},
{
  q:``,
  a:``
},
{
  q:``,
  a:``
}]
for (q in qlist) {
if (qlist[q].a == "") {
  break;
}
  document.querySelector("section").innerHTML += `<div class="wrapper"><div class="q"><span style="color:teal">سوال نمبر ${Number(q)+1}: </span>${qlist[q].q}</div><div class="a"><b>جواب:</b> ${qlist[q].a}</div></div>`
}
async function font() {
  const r = new XMLHttpRequest();
  r.open("GET","./noto.ttf");
  r.addEventListener("loadend",()=> {
  let css = document.createElement("style")
  css.innerHTML = `@font-face {
  font-family: "Mehr";
  src: url(./noto.ttf);
}
section .wrapper .a {
  font-size: 13px;
  line-height: 32px;
  font-family: "Mehr";
}`
    document.head.appendChild(css)
  })
  r.send()
}
font()
document.querySelectorAll("div.q").forEach(d=>{
  d.addEventListener("click", function (e){
    let t = event.target
    t.classList.toggle("active")
    if( 
      t.classList.contains("active")
    ) {
      t.nextElementSibling.classList.add("active")
    }else {
      t.nextElementSibling.classList.remove("active")
    }
  })
})
